graph=[
    [0,20,0,0,0,34,0,0,9],
    [20,0,11,0,0,0,3,0,0],
    [0,11,0,7,0,0,3,0,0],
    [0,0,7,0,3,0,0,0,9],
    [0,0,0,3,0,26,0,0,0,5],
    [34,0,0,0,26,0,0,0,5],
    [0,3,3,0,0,0,0,1,0],
    [0,0,0,0,0,0,1,0,1],
    [9,0,0,9,5,5,0,1,0]
]
#кол-во вершин
def ver(graph):
    print("Колличество вершин:", len(graph))

#кол-во вершин у которых степень 3
def ver_3(graph):
    count=0
    for i in graph:
        k=0 #кол-во ненулевых элементов в строке
        for j in i:
            if graph[i][j] !=0:
                k+=1
        if k==3:
            count+=1
print("Колличество вершин со степенью 3:",count)

#кол-во ребер
count=0
for i in graph:
    for j in i:
        if j !=0:
            count+=1
print("Колличество ребер:", count//2)


#сумма весов всех ребер
def sum_edges(graph):
    count=0
    for i in graph:
        for j in i:
            count+=j
print("Сумма весов всех ребер:",count//2)

#кол-во соседей вершины F
